<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"k8s_dev","backend":"90607c7136683316f57f3a4f076af45a968b6135a38e231f6a70cd860a646af6","plan_job_ref":"Job Code tests #29 at https://github.com/Bh-an/EKS-GoWebserver/actions/runs/14611505569","plan_out_hash":"ae2a7e2ad2a5143e68493b6a7dee69a0a46fa197b7cc2fc1d743a4c3891fb232","plan_hash":"bab077349faf19743708a76f9862f61cd01a8e6aee14dc7ab90747fa27bb2246","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __k8s_dev__
<details>
<summary>Plan: 28 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cluster.aws_eks_cluster.eks_cluster will be created
+   resource "aws_eks_cluster" "eks_cluster" {
+       arn                   = (known after apply)
+       certificate_authority = (known after apply)
+       cluster_id            = (known after apply)
+       created_at            = (known after apply)
+       endpoint              = (known after apply)
+       id                    = (known after apply)
+       identity              = (known after apply)
+       name                  = "default_cluster"
+       platform_version      = (known after apply)
+       role_arn              = (known after apply)
+       status                = (known after apply)
+       tags_all              = (known after apply)
+       version               = (known after apply)

+       kubernetes_network_config (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.cluster.aws_eks_node_group.private-nodes will be created
+   resource "aws_eks_node_group" "private-nodes" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = "ON_DEMAND"
+       cluster_name           = "default_cluster"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3.small",
        ]
+       labels                 = {
+           "node" = "kubenode02"
        }
+       node_group_name        = "default_nodegroup"
+       node_group_name_prefix = (known after apply)
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = (known after apply)
+       tags_all               = (known after apply)
+       version                = (known after apply)

+       launch_template {
+           id      = (known after apply)
+           name    = "eks_node"
+           version = (known after apply)
        }

+       scaling_config {
+           desired_size = 1
+           max_size     = 4
+           min_size     = 0
        }

+       update_config {
+           max_unavailable = 1
        }
    }

  # module.cluster.aws_launch_template.eks_node will be created
+   resource "aws_launch_template" "eks_node" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       latest_version  = (known after apply)
+       name            = "eks_node"
+       name_prefix     = (known after apply)
+       tags_all        = (known after apply)
+       user_data       = (known after apply)

+       metadata_options (known after apply)
    }

  # module.iam.data.aws_iam_policy.ecrpolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "ecrpolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksclusterpolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksclusterpolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.ekscnipolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "ekscnipolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksnodegrouppolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksnodegrouppolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy.eksservicepolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "eksservicepolicy" {
+       arn         = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
+       description = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = (known after apply)
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = (known after apply)
    }

  # module.iam.data.aws_iam_policy_document.eks_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]

+           principals {
+               identifiers = [
+                   "eks.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.iam.data.aws_iam_policy_document.nodegroup_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "nodegroup_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.iam.aws_iam_role.cluster_role will be created
+   resource "aws_iam_role" "cluster_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "test-eks-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags                  = {
+           "Environment" = "test"
+           "Platform"    = "k8s"
        }
+       tags_all              = {
+           "Environment" = "test"
+           "Platform"    = "k8s"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.node_group_role will be created
+   resource "aws_iam_role" "node_group_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "test-node-group-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags                  = {
+           "Environment" = "test"
+           "Platform"    = "k8s"
        }
+       tags_all              = {
+           "Environment" = "test"
+           "Platform"    = "k8s"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonECRPolicy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "AmazonECRPolicy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "test-node-group-role"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSCNIPolicy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "AmazonEKSCNIPolicy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = "test-node-group-role"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = "test-eks-role"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSNodegroupPolicy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "AmazonEKSNodegroupPolicy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = "test-node-group-role"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSServicePolicy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "AmazonEKSServicePolicy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
+       role       = "test-eks-role"
    }

  # module.networking.aws_eip.nat_eip will be created
+   resource "aws_eip" "nat_eip" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-nat-eip"
+           "Platform"    = "k8s"
        }
+       tags_all             = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-nat-eip"
+           "Platform"    = "k8s"
        }
+       vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.ig will be created
+   resource "aws_internet_gateway" "ig" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-igw"
+           "Platform"    = "k8s"
        }
+       tags_all = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-igw"
+           "Platform"    = "k8s"
        }
+       vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat will be created
+   resource "aws_nat_gateway" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-nat-gw"
+           "Platform"    = "k8s"
        }
+       tags_all             = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-nat-gw"
+           "Platform"    = "k8s"
        }
    }

  # module.networking.aws_route_table.private will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
#                (12 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-private-route-table"
+           "Platform"    = "k8s"
        }
+       tags_all         = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-private-route-table"
+           "Platform"    = "k8s"
        }
+       vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
#                (12 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-public-route-table"
+           "Platform"    = "k8s"
        }
+       tags_all         = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-public-route-table"
+           "Platform"    = "k8s"
        }
+       vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.private_subnet[0] will be created
+   resource "aws_subnet" "private_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-private-subnet-ap-south-1a"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/internal-elb"       = "1"
        }
+       tags_all                                       = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-private-subnet-ap-south-1a"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/internal-elb"       = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.private_subnet[1] will be created
+   resource "aws_subnet" "private_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-private-subnet-ap-south-1b"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/internal-elb"       = "1"
        }
+       tags_all                                       = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-private-subnet-ap-south-1b"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/internal-elb"       = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public_subnet[0] will be created
+   resource "aws_subnet" "public_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-public-subnet-ap-south-1a"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/elb"                = "1"
        }
+       tags_all                                       = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-public-subnet-ap-south-1a"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/elb"                = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public_subnet[1] will be created
+   resource "aws_subnet" "public_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-public-subnet-ap-south-1b"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/elb"                = "1"
        }
+       tags_all                                       = {
+           "Environment"                           = "test"
+           "Name"                                  = "k8s-test-public-subnet-ap-south-1b"
+           "Platform"                              = "k8s"
+           "kubernetes.io/cluster/default_cluster" = "owned"
+           "kubernetes.io/role/elb"                = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.vpc will be created
+   resource "aws_vpc" "vpc" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-vpc-ap-south-1"
+           "Platform"    = "k8s"
        }
+       tags_all                             = {
+           "Environment" = "test"
+           "Name"        = "k8s-test-vpc-ap-south-1"
+           "Platform"    = "k8s"
        }
    }

  # module.oidc.data.aws_iam_policy_document.aws_cloud_controller_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_cloud_controller_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRoleWithWebIdentity",
            ]
+           effect  = "Allow"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
+               variable = (known after apply)
            }

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "Federated"
            }
        }
    }

  # module.oidc.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.oidc.aws_iam_openid_connect_provider.eks will be created
+   resource "aws_iam_openid_connect_provider" "eks" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags_all        = (known after apply)
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.oidc.aws_iam_policy.aws_cloud_controller will be created
+   resource "aws_iam_policy" "aws_cloud_controller" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "AWSLoadBalancerControllerIAMPolicy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "iam:CreateServiceLinkedRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:DescribeAccountAttributes",
+                           "ec2:DescribeAddresses",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:DescribeInternetGateways",
+                           "ec2:DescribeVpcs",
+                           "ec2:DescribeVpcPeeringConnections",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribeTags",
+                           "ec2:GetCoipPoolUsage",
+                           "ec2:DescribeCoipPools",
+                           "ec2:GetSecurityGroupsForVpc",
+                           "ec2:DescribeIpamPools",
+                           "elasticloadbalancing:DescribeLoadBalancers",
+                           "elasticloadbalancing:DescribeLoadBalancerAttributes",
+                           "elasticloadbalancing:DescribeListeners",
+                           "elasticloadbalancing:DescribeListenerCertificates",
+                           "elasticloadbalancing:DescribeSSLPolicies",
+                           "elasticloadbalancing:DescribeRules",
+                           "elasticloadbalancing:DescribeTargetGroups",
+                           "elasticloadbalancing:DescribeTargetGroupAttributes",
+                           "elasticloadbalancing:DescribeTargetHealth",
+                           "elasticloadbalancing:DescribeTags",
+                           "elasticloadbalancing:DescribeTrustStores",
+                           "elasticloadbalancing:DescribeListenerAttributes",
+                           "elasticloadbalancing:DescribeCapacityReservation",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "cognito-idp:DescribeUserPoolClient",
+                           "acm:ListCertificates",
+                           "acm:DescribeCertificate",
+                           "iam:ListServerCertificates",
+                           "iam:GetServerCertificate",
+                           "waf-regional:GetWebACL",
+                           "waf-regional:GetWebACLForResource",
+                           "waf-regional:AssociateWebACL",
+                           "waf-regional:DisassociateWebACL",
+                           "wafv2:GetWebACL",
+                           "wafv2:GetWebACLForResource",
+                           "wafv2:AssociateWebACL",
+                           "wafv2:DisassociateWebACL",
+                           "shield:GetSubscriptionState",
+                           "shield:DescribeProtection",
+                           "shield:CreateProtection",
+                           "shield:DeleteProtection",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:AuthorizeSecurityGroupIngress",
+                           "ec2:RevokeSecurityGroupIngress",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:CreateSecurityGroup",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
                        ]
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:CreateTags",
+                           "ec2:DeleteTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
+                   {
+                       Action    = [
+                           "ec2:AuthorizeSecurityGroupIngress",
+                           "ec2:RevokeSecurityGroupIngress",
+                           "ec2:DeleteSecurityGroup",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:CreateLoadBalancer",
+                           "elasticloadbalancing:CreateTargetGroup",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:CreateListener",
+                           "elasticloadbalancing:DeleteListener",
+                           "elasticloadbalancing:CreateRule",
+                           "elasticloadbalancing:DeleteRule",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:AddTags",
+                           "elasticloadbalancing:RemoveTags",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:AddTags",
+                           "elasticloadbalancing:RemoveTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:ModifyLoadBalancerAttributes",
+                           "elasticloadbalancing:SetIpAddressType",
+                           "elasticloadbalancing:SetSecurityGroups",
+                           "elasticloadbalancing:SetSubnets",
+                           "elasticloadbalancing:DeleteLoadBalancer",
+                           "elasticloadbalancing:ModifyTargetGroup",
+                           "elasticloadbalancing:ModifyTargetGroupAttributes",
+                           "elasticloadbalancing:DeleteTargetGroup",
+                           "elasticloadbalancing:ModifyListenerAttributes",
+                           "elasticloadbalancing:ModifyCapacityReservation",
+                           "elasticloadbalancing:ModifyIpPools",
                        ]
+                       Condition = {
+                           Null = {
+                               "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
                    },
+                   {
+                       Action    = [
+                           "elasticloadbalancing:AddTags",
                        ]
+                       Condition = {
+                           Null         = {
+                               "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
+                           StringEquals = {
+                               "elasticloadbalancing:CreateAction" = [
+                                   "CreateTargetGroup",
+                                   "CreateLoadBalancer",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
+                           "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RegisterTargets",
+                           "elasticloadbalancing:DeregisterTargets",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:SetWebAcl",
+                           "elasticloadbalancing:ModifyListener",
+                           "elasticloadbalancing:AddListenerCertificates",
+                           "elasticloadbalancing:RemoveListenerCertificates",
+                           "elasticloadbalancing:ModifyRule",
+                           "elasticloadbalancing:SetRulePriorities",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.oidc.aws_iam_role.aws_cloud_controller_manager will be created
+   resource "aws_iam_role" "aws_cloud_controller_manager" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "test-cloud-controller"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.oidc.aws_iam_role_policy_attachment.eks_cluster_autoscaler_attach will be created
+   resource "aws_iam_role_policy_attachment" "eks_cluster_autoscaler_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "test-cloud-controller"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   vpc_id = (known after apply)
```
</details>

:memo: Plan generated in [Code tests #29](https://github.com/Bh-an/EKS-GoWebserver/actions/runs/14611505569)